namespace tech.quagma.ꗃⳆmaths.ꗃⳆgeometry

// complex algebra (p=2, q=0)
module ꕺⳆuseꓽᎶꓹ2ꓹ0=

// multi-vector in Ꮆ(2, 0)
    type ᑉᎶᐣ= {|
            ``λꓸ``: float; // ᑉeꓸᐣ
            ``λ₁``: float; // ᑉe₁ᐣ
            ``λ₂``: float; // ᑉe₂ᐣ
            ``λ₁₂``: float; // ᑉe₁₂ᐣ
    |}

    let ``ꖴꓸ`` // int. product on eꓸ
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            + ᑉuᐣ.``λꓸ`` * ᑉvᐣ.``λꓸ``
            + ᑉuᐣ.``λ₁`` * ᑉvᐣ.``λ₁``
            + ᑉuᐣ.``λ₂`` * ᑉvᐣ.``λ₂``
            - ᑉuᐣ.``λ₁₂`` * ᑉvᐣ.``λ₁₂``

    let ``ꖴ₁`` // int. product on e₁
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            + ᑉuᐣ.``λꓸ`` * ᑉvᐣ.``λ₁``
            + ᑉuᐣ.``λ₁`` * ᑉvᐣ.``λꓸ``
            - ᑉuᐣ.``λ₂`` * ᑉvᐣ.``λ₁₂``
            + ᑉuᐣ.``λ₁₂`` * ᑉvᐣ.``λ₂``

    let ``ꖴ₂`` // int. product on e₂
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            + ᑉuᐣ.``λꓸ`` * ᑉvᐣ.``λ₂``
            + ᑉuᐣ.``λ₁`` * ᑉvᐣ.``λ₁₂``
            + ᑉuᐣ.``λ₂`` * ᑉvᐣ.``λꓸ``
            - ᑉuᐣ.``λ₁₂`` * ᑉvᐣ.``λ₁``

    let ``ꖴ₁₂`` // int. product on e₁₂
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            + ᑉuᐣ.``λꓸ`` * ᑉvᐣ.``λ₁₂``
            + ᑉuᐣ.``λ₁₂`` * ᑉvᐣ.``λꓸ``

    let ``ꖴ`` // full interior product
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ): ᑉᎶᐣ= {|
            ``λꓸ``= ``ꖴꓸ`` ᑉuᐣ ᑉvᐣ;
            ``λ₁``= ``ꖴ₁`` ᑉuᐣ ᑉvᐣ;
            ``λ₂``= ``ꖴ₂`` ᑉuᐣ ᑉvᐣ;
            ``λ₁₂``= ``ꖴ₁₂`` ᑉuᐣ ᑉvᐣ;
        |}

    let ``ꕕꓸ`` // ext. product on eꓸ
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            0

    let ``ꕕ₁`` // ext. product on e₁
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            0

    let ``ꕕ₂`` // ext. product on e₂
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            0

    let ``ꕕ₁₂`` // ext. product on e₁₂
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ)=
            + ᑉuᐣ.``λ₁`` * ᑉvᐣ.``λ₂``
            - ᑉuᐣ.``λ₂`` * ᑉvᐣ.``λ₁``

    let ``ꕕ`` // full exterior product
        (ᑉuᐣ: ᑉᎶᐣ)
        (ᑉvᐣ: ᑉᎶᐣ): ᑉᎶᐣ= {|
            ``λꓸ``= ``ꕕꓸ`` ᑉuᐣ ᑉvᐣ;
            ``λ₁``= ``ꕕ₁`` ᑉuᐣ ᑉvᐣ;
            ``λ₂``= ``ꕕ₂`` ᑉuᐣ ᑉvᐣ;
            ``λ₁₂``= ``ꕕ₁₂`` ᑉuᐣ ᑉvᐣ;
        |}